#ifndef MCS_BP_Parameter_H_
#define MCS_BP_Parameter_H_

#include "main.h"
/*----------------------------------------程序版本(PF)------------------------------------------------------------------------------------------------------*/

#define Versions                          ("BPMC_v2.0.5")                                          /* PF.00 ,程序版本 */

/*----------------------------------------电机参数(P0)------------------------------------------------------------------------------------------------------*/
/* 电机型号选择相关 */
#define Motor_Model 			4020			//电机型号	可选3520  3535  4020  4030

#if(Motor_Model == 4030)
#define	Pole_Pairs 			    			 			  (4)				     									  		                 /* P0.00 ,电机极对数 */
#define Rs               					 			  (0.43)					                                     /* P0.01 ,单位: Ω  电机相电阻,任意两相线间的电阻值除以2 */
#define LD               					 			  (0.74)													                         	 /* P0.02 ,单位: mH 电机d轴电感,任意两相线间的电感值除以2 */
#define LQ               					 			  (0.765)								                             	 /* P0.03 ,单位: mH 电机q轴电感,,任意两相线间的电感值除以2 */

#elif(Motor_Model == 4020)
#define	Pole_Pairs 			    			 			  (4)				     									  		                 /* P0.00 ,电机极对数 */
#define Rs               					 			  (0.25)	//0.25				                                     /* P0.01 ,单位: Ω  电机相电阻,任意两相线间的电阻值除以2 */
#define LD               					 			  (0.34)													                         	 /* P0.02 ,单位: mH 电机d轴电感,任意两相线间的电感值除以2 */
#define LQ               					 			  (0.365)								                             	 /* P0.03 ,单位: mH 电机q轴电感,,任意两相线间的电感值除以2 */

#elif(Motor_Model == 3535)
#define	Pole_Pairs 			    			 			 (6)					     									  		 /* P0.00 ,电机极对数 */
#define Rs               					 			 (0.3)								                                     /* P0.01 ,单位: Ω  电机相电阻,任意两相线间的电阻值除以2 */
#define LD               					 			 (0.3)													                 /* P0.02 ,单位: mH 电机d轴电感,任意两相线间的电感值除以2 */
#define LQ               					 			 (0.33)											                         /* P0.03 ,单位: mH 电机q轴电感,,任意两相线间的电感值除以2 */

#elif(Motor_Model == 3520)
#define	Pole_Pairs 			    			 			  (6)				     									  		                 /* P0.00 ,电机极对数 */
#define Rs               					 			  (0.8)					                                     /* P0.01 ,单位: Ω  电机相电阻,任意两相线间的电阻值除以2 */
#define LD               					 			  (0.42)													                         	 /* P0.02 ,单位: mH 电机d轴电感,任意两相线间的电感值除以2 */
#define LQ               					 			  (0.505)								                             	 /* P0.03 ,单位: mH 电机q轴电感,,任意两相线间的电感值除以2 */

#endif
/*----------------------------------------功率转速限制参数(P1)--------------------------------------------------------------------------------------------------*/
#define Power_Limit                       (200)                                                     /* P1.00 ,最高功率 */
#define Speed_Limit                       (20000)                                                   /* P1.01 ,最高转速 单位：转/min */

/*----------------------------------------电机运行模式选择(P2)----------------------------------------------------------------------------------------------*/
/*----------------------------------------控制模式模式(Px)---------------------------------------------------------------------------------------------*/
#define SPEED_CONTROL_MODE_HALL             1
#define POSIT_CONTROL_MODE_HALL             0

#define CONTROL_MODE_HALL                   POSIT_CONTROL_MODE_HALL   /* 霍尔运行模式 */


/*----------------------------------------电机默认方向选择(P2)----------------------------------------------------------------------------------------------*/

#define PowerUP_Motor_Start_Dir           (MOTOR_DIR_FWD)                                          /* P2.01 0-MOTOR_DIR_FWD - 正转;

1-MOTOR_DIR_REV - 反转 */


/*----------------------------------------电机测试模式选择(P2)---------------------------------------------------------------------------------------------*/

#define MOTOR_CONTROL_DEMO                                                                        /* P2.03 ,打开注释是演示模式,注释是正常模式*/

/*----------------------------------------串口debug调试模式(Px)---------------------------------------------------------------------------------------------*/
//#define UART_TRACE_DEBUG_ENABLE						0																									    /* 1 开启串口打log调试，0 关闭;*/

/*----------------------------------------RTTdebug调试模式(Px)---------------------------------------------------------------------------------------------*/

#define FUNCTION_ON                         1
#define FUNCTION_OFF                        0

#define RTT_FUNCTION                      FUNCTION_OFF                                             /* RTT 调试功能 */




#endif
